#+title:Variational Bayes and parallel algorithms for fitting mixture models to large genotype data sets
#+author:Dan Davison
#+date:\today

** Org config
#+startup: oddeven content
#+begin_src emacs-lisp :exports results
(setq org-src-preserve-indentation t)
(setq org-latex-to-pdf-process '("make pdf"))

(setq org-export-latex-default-packages-alist
      (remove-if (lambda (el) (and (listp el) (equal (second el) "hyperref")))
		 org-export-latex-default-packages-alist))

(setq org-export-latex-classes
      '(("article"
	 "\\documentclass{article}
[PACKAGES]
[EXTRA]"
	 ("\\section{%s}" . "\\section*{%s}")
	 ("\\subsection{%s}" . "\\subsection*{%s}")
	 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
	 ("\\paragraph{%s}" . "\\paragraph*{%s}")
	 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

(setq org-entities-user
      (mapcar (lambda (ent) (list ent ent t))
	      '("i" "j" "k" "K" "l" "n" "p" "P" "q" "Q" "X" "Z")))

(setq org-export-latex-packages-alist
      '(("" "newalg" t)))
#+end_src

#+results:
| i | i | t |
| j | j | t |
| k | k | t |
| K | K | t |
| l | l | t |
| n | n | t |
| p | p | t |
| P | P | t |
| q | q | t |
| Q | Q | t |
| X | X | t |
| Z | Z | t |
: t
